<HTML>
<HEAD>
  <meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
  <meta name="generator" content="Adobe GoLive 5">
<TITLE>devoirs 2001-2001</TITLE>
		<link rel="stylesheet" href="../textes.css">
	</HEAD>
<BODY>

<H4><CENTER>
				<h2>Devoirs 2001-2002</h2>
			</CENTER></H4>

<UL>
  <LI>DM 1 : <A HREF="M0101E.pdf">&Eacute;nonc&eacute;</A> Corrig&eacute;.
  Ensembles, manipulations de sommes et th&eacute;or&egrave;me
  de Sperner.
  <LI>DS 1 : <A HREF="S0101E.pdf">&Eacute;nonc&eacute;</A> . Ensembles,
  manipulations de sommes et th&eacute;or&egrave;me de Erd&ouml;s-Szekeres
  (extraction de suites monotones).
  <LI>DM 2 : <A HREF="M0102E.pdf">&Eacute;nonc&eacute;</A> <A 
  HREF="M0102C.pdf">Corrig&eacute;</A>. Nombre de surjections.
  <LI>DS 2 : <A HREF="S0102E.pdf">&Eacute;nonc&eacute;</A> . Calculs
  avec des nombres complexes, noyaux de Dirichlet et de Fejer,
  demi-plan de Poincar&eacute;.
  <LI>DM 3 : <A HREF="M0103E.pdf">&Eacute;nonc&eacute;</A> <A 
  HREF="M0103C.pdf">Corrig&eacute;</A>. Exercices sur les fonctions
  usuelles, les nombres complexes etdes sommations.
  <LI>DM 4 : <A HREF="M0104E.pdf">&Eacute;nonc&eacute;</A> <A 
  HREF="M0104C.pdf">Corrig&eacute;</A>. Limite de la somme des
  inverses des carr&eacute;s avec un polyn&ocirc;me et un encadrement.
  <LI>DS 3 : <A HREF="S0103E.pdf">&Eacute;nonc&eacute;</A> <A 
  HREF="S0103C.pdf">Corrig&eacute;</A>. Calculs avec des nombres
  complexes et des fonctions usuelles.
  <LI>DM 5 : <a href="M0105E.pdf">&Eacute;nonc&eacute;</a> <a href="M0105C.pdf">Corrig&eacute;</a>. Deux exercices sur les poyn&ocirc;mes.
			<li>DM 6 : <a href="M0106E.pdf">&Eacute;nonc&eacute;</a> <a href="M0106C.pdf">Corrig&eacute;</a>. D&eacute;veloppements limit&eacute;s, introduction aux fonctions g&eacute;n&eacute;ratrices.
			<li>DS 4 : <a href="S0104E.pdf">&Eacute;nonc&eacute;</a> <a href="S0104C.pdf">Corrig&eacute;</a>. Suites, polyn&ocirc;mes et feuille de calculs rapides sur les d&eacute;veloppemnts limit&eacute;s.
			<li>DM 7 : <a href="M0107E.pdf">&Eacute;nonc&eacute;</a>. <a href="M0107C.pdf">Corrig&eacute;</a>. Comparaisons et d&eacute;veloppements de suites de nombres r&eacute;els intervenant dans l'&eacute;tude d'une suite de nombres complexes. 
			<li>DS 5 : <a href="S0105E.pdf">&Eacute;nonc&eacute;</a>. <a href="S0105C.pdf">Corrig&eacute;</a>. Equation fonctionelle. &Eacute;tude d'une courbe param&eacute;tr&eacute;e (d'apr&egrave;s Centrale 2001 MP1). Moyennisation d'un projecteur (d'apr&egrave;s E3A 2001 MP2)
			<li>DM 8 : <a href="M0108E.pdf">&Eacute;nonc&eacute;</a> et <a href="M0108C.pdf"> Corrig&eacute;</a>.Expression de la limite des suites arithmético-géométriques à l'aide d'une intégrale.
			<li>DM 9 : <a href="M0109E.pdf">&Eacute;nonc&eacute;</a> et Corrig&eacute; Alg&egrave;bre lin&eacute;aire avec des polyn&ocirc;mes sans calcul matriciel.	
			<li>DS 7 : <a href="S0107E.pdf">&Eacute;nonc&eacute;</a> et <a href="S0107C.pdf"> Corrig&eacute;</a> Trois exercices avec des int&eacute;grales, un exercice de sommation d'une suite avec une d&eacute;composition en &eacute;l&eacute;ments simples.

			<li>DM11 : <a href="M0111E.pdf">&Eacute;nonc&eacute;</a> et <a href="M0111C.PDF">Corrig&eacute;</a> Un probl&egrave;me sur des d&eacute;nombrements de permutations et un autour du th&eacute;or&egrave;me de Cayley-Hamilton (sans valeur propre). 
			<li>DS 8 : <a href="S0108E.pdf">&Eacute;nonc&eacute;</a> et<a href="S0108C.pdf"> Corrig&eacute;</a> Pr&eacute;liminaire, premi&egrave;re et deuxi&egrave;me partie de 
				<a href="EAlgLin1.pdf">l'&eacute;preuve maths 1 </a>du concours commun Mines-Ponts 2001 PC.

			<li>DM 12 : Ce probl&egrave;me est form&eacute; par des extraits de 4 parties <br>
				       <a href="../fracpol/FP1_21.doc">Polyn&ocirc;mes orthogonaux introduction</a><br>
				       <a href="../fracpol/FP1_15.doc">Un calcul de d&eacute;terminant</a><br>
				       <a href="../fracpol/FP2_14.doc">Polyn&ocirc;mes de Laguerre : r&eacute;currence lin&eacute;aire</a><br>
				       <a href="../fracpol/FP1_12.doc">D&eacute;terminants de matrices tridiagonales</a><br>
				  tir&eacute;es de l'ouvrage <a href="../fracpol/intro.doc">Fractions et polyn&ocirc;mes</a>. Attention, ces fichiers n&eacute;c&eacute;ssitent Word pour &ecirc;tre visualis&eacute;s. Seuls les liens obtenus &agrave; partir de <a href="../fracpol/intro.doc">Fractions et polyn&ocirc;mes</a> sont fonctionnels.	
			<li>DS 11 : <a href="S0111E.pdf">&Eacute;nonc&eacute;</a> Un exercice sur des barycentres, un probl&egrave;me d'apr&egrave;s Mines d'Albi 1993 sur les rotations vectorielles.
		</UL>

</BODY>
</HTML>