<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Adobe GoLive 5">
		<title>Devoirs année 2002_2003</title>
		<link rel="stylesheet" href="../textes.css">
	</head>

	<body bgcolor="#ffffff">
		<h2>Devoirs 2002-2003</h2>
		<ul>
			<li>DM 1 : <a href="M0201E.pdf">&Eacute;nonc&eacute;</a> - <a href="M0201C.pdf">Corrig&eacute;</a> ; Exemples de sommations,  borne inf&eacute;rieure et addition parall&egrave;le</li>
			<li>DS 1 : <a href="S0201E.pdf">&Eacute;nonc&eacute;</a>  - <a href="S0201C.pdf">Corrig&eacute;</a> ; Exercices (bin&ocirc;me, nombre d'op&eacute;rations). Probl&egrave;me : polyn&ocirc;mes de Bernstein.  
			<li>DM 2 : <a href="M0202E.pdf">&Eacute;nonc&eacute;</a> - <a href="M0202C.pdf">Corrig&eacute;</a> ; Sous-groupes de (R,+).
			<li>DM 3 : <a href="M0203E.pdf">&Eacute;nonc&eacute;</a> - <a href="M0203C.pdf">Corrig&eacute;</a> ; Calculs avec des nombres complexes et des fonctions usuelles. Polyn&ocirc;mes de Tchebychev.
			<li>DS 2 : <a href="S0202E.pdf">&Eacute;nonc&eacute;</a>  - <a href="S0201C.pdf">Corrig&eacute;</a> ; Exercices avec des nombres complexes, des fonctions usuelles et des polyn&ocirc;mes.
			<li>DM 4 : <a href="M0204E.pdf">&Eacute;nonc&eacute;</a>  - <a href="M0204C.pdf">Corrig&eacute;</a> ; Polyn&ocirc;mes et suites. Limite de la suite des sommes des 1/k^2.

			<li>DM 5 : <a href="M0205E.pdf">&Eacute;nonc&eacute;</a>  - <a href="M0205C.pdf">Corrig&eacute;</a> ; Deux exercices sur les polyn&ocirc;mes.			<li>DM 6 : <a href="M0206E.pdf">&Eacute;nonc&eacute;</a> ; D&eacute;veloppements limit&eacute;s, introduction aux fonctions g&eacute;n&eacute;ratrices, nombres de Fibonacci, nombres de d&eacute;rangements, nombres de partitions.			<li>DS 3 : <a href="S0203E.pdf">&Eacute;nonc&eacute;</a> ; Exercices sur des d&eacute;veloppements limit&eacute;s. Probl&egrave;me sur des suites.

			<li>DM 7 : <a href="M0207E.pdf">&Eacute;nonc&eacute;</a>  - <a href="M0207C.pdf">Corrig&eacute;</a>; Un probl&egrave;me sur un ensemble de r&eacute;els d&eacute;fini &agrave; partir d'une fonction.

			<li>DS 4 : <a href="S0204E.pdf">&Eacute;nonc&eacute;</a> - <a href="S0204C.pdf">Corrig&eacute;</a> ; Polyn&ocirc;mes sym&eacute;triques &eacute;l&eacute;mentaires, d&eacute;composition en &eacute;l&eacute;ments simples. Points de franchissement pour une fonction continue sur un segment. 
			<li>DM 8 : <a href="M0208E.pdf">&Eacute;nonc&eacute;</a>  ; Alg&egrave;bre lin&eacute;aire sans dimension. Moyennisation d'un projecteur.. 
			<li>DS 6 : <a href="S0206E.pdf">&Eacute;nonc&eacute; </a>; Deux exercices polyn&ocirc;mes, op&eacute;rateur int&eacute;gral. Probl&egrave;me sur les z&eacute;ros d'une fonction : r&egrave;gle de Descartes, s&eacute;paration, isolement. 
			<li>DS 7 : <a href="S0207E.pdf">&Eacute;nonc&eacute; </a>; Alg&egrave;bre lin&eacute;aire. 
			<li>DM 11 : <a href="M0211E.pdf">&Eacute;nonc&eacute;</a> et <a href="M0211C.pdf">Corrig&eacute;</a> ; Pr&eacute;liminaire, premi&egrave;re et deuxi&egrave;me partie de <a href="EAlgLin1.pdf">l'&eacute;preuve maths 1 </a>du concours commun Mines-Ponts 2001 PC. Exercice d'alg&egrave;bre lin&eacute;aire. 
			<li>DM 12 : <a href="M0212E.pdf">&Eacute;nonc&eacute;</a> ; Birapport de quatre droites dans un plan (vectoriel). Utilise de l'alg&egrave;bre lin&eacute;aire &eacute;l&eacute;mentaire, des d&eacute;terminants 2,2 et des permutations.	
			<li>DS 8 :  <a href="S0208E.pdf">&Eacute;nonc&eacute;</a> et <a href="S0208C.pdf">Corrig&eacute;</a> ; Un exercice avec des matrices. Un exercice et un probl&egrave;me avec des int&eacute;grales sur un intervalle ouvert.

			<li>DS 10 : <a href="S0210E.pdf">&Eacute;nonc&eacute;</a> ; Premier probl&egrave;me : produit vectoriel, cofacteurs, recherche des plans stables. Deuxi&egrave;me probl&egrave;me : g&eacute;om&eacute;trie analytique,  centres des triangles &eacute;quilat&eacute;raux inscrits dans un carr&eacute;. 
			<li>DS 11: <a href="S0211E.pdf">&Eacute;nonc&eacute;</a> ; Polyn&ocirc;mes de Tchebychev, distances, bornes sup, d&eacute;terminants de VanderMonde, une sommation de type C&eacute;saro. (j'ignore qui est l'auteur de ce corrig&eacute; fourni par l'UPS). 
			<li> 
		</ul>
	</body>

</html>